#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-036ede2188fe822b8]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-096b3c54d4e0a6872]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-0a305ab5f27cd389d]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0ac9a9002bdd045b7]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-020fa9967c140a6e3]
module.network.aws_route_table.public: Refreshing state... [id=rtb-087a887da8415bdff]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-058faf506e28b7ed9]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-0679502cda57e36c2]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-0f5769fab850ba4bf]
module.network.aws_route.public: Refreshing state... [id=r-rtb-087a887da8415bdff1080289494]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3526099007]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-277310025]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1487212442]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4164028779]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-03c2cb8006b96ede9]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0f6bf83bb9017e085]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/494f35997016adc0]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/76ad894c36a5743c]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/494f35997016adc0/2cc888293b062165]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 release tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "release",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "machamp-repository"
    }

  # module.ecr.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "machamp-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>